# 2. З допомогою Python порахувати наступні вирази для a=1, b=5, c=4:
def calc(a=1, b=5, c=4):
    x1, x2 = int(), int()
    x1 = -b + (b**2 - 4 * a * c) ** 0.5 / 2 * a
    x2 = -b - (b**2 - 4 * a * c) ** 0.5 / 2 * a
    print(f'x1 = {x1}, \nx2 = {x2}')
calc()


# 3. Написати програму, що за допомогою функції input() запитує ім'я користувача і потім виводить вітання на екран.

name = input('Enter your name: ')
print(f'Hello, {name}!')

# 4. Написати програму, що за допомогою функції input() запитує кількість гривень і потім виводить еквіваленте число
# доларів США (курс довільний -- можна підгледіти на будь-яку дату у вашому банку або у НБУ).

hryvna = int(input('Введіть кількість гривень: '))
exchange_rate = int(input('Введіть курс долару: '))
res = hryvna / exchange_rate
print(res)